#+TITLE: Racket install

#+name: get-racket
#+header: :provides file(path="src/racket-6.1.1-x86_64-linux-debian-squeeze.sh")
#+BEGIN_SRC sh :dir src
curl -O http://mirror.racket-lang.org/installers/6.1.1/racket-6.1.1-x86_64-linux-debian-squeeze.sh
#+END_SRC

#+name: file
#+BEGIN_SRC sh
[[ -e $path ]]
#+END_SRC

#+name: install-racket
#+BEGIN_SRC sh :dir src
./racket-6.1.1-x86_64-linux-debian-squeeze.sh --in-place --dest racket-6.1.1
#+END_SRC

#+BEGIN_SRC sh :results output
ls src/racket-6.1.1/*
#+END_SRC

#+RESULTS:
#+begin_example
src/racket-6.1.1/README

src/racket-6.1.1/bin:
drracket
gracket
gracket-text
mred
mred-text
mzc
mzpp
mzscheme
mztext
pdf-slatex
plt-games
plt-help
plt-r5rs
plt-r6rs
plt-web-server
racket
raco
scribble
setup-plt
slatex
slideshow
swindle

src/racket-6.1.1/collects:
acks
compiler
data
db
dynext
ffi
file
info
info-domain
json
launcher
net
openssl
pkg
planet
racket
raco
reader
realm
setup
s-exp
syntax
unstable
version
xml

src/racket-6.1.1/doc:
acks
algol60
blueboxes.rktd
browser
bug-report
cards
compatibility
continue
contract-profile
data
datalog
db
deinprogramm
demo-m1
demo-m2
demo-manual-m1
demo-manual-m2
demo-manual-s1
demo-manual-s2
demo-s1
demo-s2
distributed-places
docindex.sqlite
doc-site.css
doc-site.js
draw
drracket
drracket-tools
ds-store
dynext
embedded-gui
eopl
errortrace
file
foreign
framework
frtime
future-visualizer
games
getting-started
gl-board-game
graphics
gui
guide
help
htdp
htdp-langs
htdp-ptr
html
images
index.html
inside
in.sxref
json
lazy
license
local-redirect
macro-debugger
make
manual-fonts.css
manual-racket.css
manual-racket.js
manual-style.css
math
more
mrlib
mysterx
mzcom
mzlib
mzscheme
net
openssl
out0.sxref
out1.sxref
parser-tools
pict
pict-snip
picturing-programs
pkg
plai
planet
plot
plt-installer
preprocessor
profile
quick
r5rs
r6rs
racket.css
racklog
rackunit
raco
readline
redex
reference
release
root-info.css
root-info.js
scheme
scribble
scribble-common.js
scribble.css
scribble-pp
scribble-style.css
scriblib
search
sgl
slatex-wrap
slideshow
srfi
stamp.sxref
stepper
string-constants
style
swindle
syntax
syntax-color
teachpack
test-engine
tool
tools
trace
ts-guide
ts-reference
turtles
unstable
unstable-find
unstable-flonum
unstable-gui
unstable-redex
version
web-server
web-server-internal
win32-ssl
xml
xrepl

src/racket-6.1.1/etc:
config.rktd

src/racket-6.1.1/include:
escheme.h
ext.exp
mzconfig.h
mzscheme3m.exp
mzscheme.exp
schemef.h
schemegc2.h
scheme.h
schemex.h
schemexm.h
schexn.h
schgc2obj.h
schthread.h
schvers.h
sconfig.h
stypes.h
uconfig.h

src/racket-6.1.1/lib:
buildinfo
gracket
launchers.rktd
mans.rktd
mzdyn3m.o
starter
starter-sh

src/racket-6.1.1/man:
man1

src/racket-6.1.1/share:
applications
COPYING_LESSER.txt
COPYING-libscheme.txt
COPYING.txt
drracket-exe-icon.png
info-cache.rktd
links.rktd
pkgs
shares.rktd
slatex.py
slatex.sty
slideshow-exe-icon.ico
#+end_example

